In [3]:
import pandas as pd

In [4]:
mydict = {"name":["ali","hasan","hossein"],"age":[10,11,12]}
mydict

{'name': ['ali', 'hasan', 'hossein'], 'age': [10, 11, 12]}

In [7]:
df = pd.DataFrame(mydict)
df

      name  age
0      ali   10
1    hasan   11
2  hossein   12

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df.shape

(3, 2)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [12]:
df.columns

Index(['name', 'age'], dtype='object')

In [13]:
df.columns.to_list()

['name', 'age']

In [14]:
df.name

0        ali
1      hasan
2    hossein
Name: name, dtype: object

In [15]:
df.age

0    10
1    11
2    12
Name: age, dtype: int64

In [16]:
df.shape

(3, 2)

In [18]:
df.count()

name    3
age     3
dtype: int64

In [19]:
df

      name  age
0      ali   10
1    hasan   11
2  hossein   12

In [20]:
df[df.age >= 11]

      name  age
1    hasan   11
2  hossein   12

In [21]:
df.age >= 11

0    False
1     True
2     True
Name: age, dtype: bool

In [22]:
df[df.name == "ali"]

  name  age
0  ali   10

In [24]:
df[(df.age > 11) & (df.age < 10)]

Empty DataFrame
Columns: [name, age]
Index: []

In [26]:
df[(df.age > 11) | (df.age <= 10)]

      name  age
0      ali   10
2  hossein   12

In [27]:
# = means assignment
myname = "majid"

#  == means comparisition
myname == "majid"

True

In [39]:
first_ppl = df.iloc[1]
first_ppl

name    hasan
age        11
Name: 1, dtype: object

In [40]:
type(first_ppl)

pandas.core.series.Series

In [43]:
print(first_ppl.name)
print(first_ppl["name"])
print(first_ppl.age)

1
hasan
11

In [45]:
df.age.mean()

11.0

In [46]:
df.age.sum()

33

In [49]:
df[df.age >= 11].age.mean()

11.5

In [52]:
newdict = {"name":["a","b","c"],"riazi":[10,12,14],"farsi":[18,19,20],"physics":[15,17,10]}
df = pd.DataFrame(newdict)
df

  name  riazi  farsi  physics
0    a     10     18       15
1    b     12     19       17
2    c     14     20       10

In [54]:
df[["riazi","physics"]]

   riazi  physics
0     10       15
1     12       17
2     14       10

In [55]:
# important - apply method

df[["riazi","physics"]].apply(sum, axis=1)

0    25
1    29
2    24
dtype: int64

In [56]:
df

  name  riazi  farsi  physics
0    a     10     18       15
1    b     12     19       17
2    c     14     20       10

In [59]:
df.set_index("name", inplace=True)

In [60]:
df

      riazi  farsi  physics
name
a        10     18       15
b        12     19       17
c        14     20       10

In [74]:
import numpy as np
df.apply(np.mean, axis=1)

name
a    14.333333
b    16.000000
c    14.666667
dtype: float64

In [76]:
df.mean()

riazi      12.0
farsi      19.0
physics    14.0
dtype: float64